wiki/org-files/index.org
#+SETUPFILE: https://fniessen.github.io/org-html-themes/org/theme-readtheorg.setup
#+TITLE:Wiki | UC Linux and FOSS Club
#+OPTIONS: num:nil
#+EXPORT_FILE_NAME: ../index.html

* Recently Added Pages
- [[./dealing-with-pdfs.html][Dealing with PDFs]]
- [[./no-linux.html][What to do if you can't use something in Linux]]
* Pinned Pages
- [[https://uc-linux-and-foss.github.io][UC/Linux Club Details]]
  
* Categorized Index

** Coping with no Linux Support
- [[./no-linux.html][What to do if you can't use something in Linux]]

** TODO UC Related
- UC Secure Connection Details
** Daily Life
- [[./dealing-with-pdfs.html][Dealing with PDFs]]
** TODO Student Life

** TODO Programming

** TODO FOSS Alternatives
The list will be constantly updating and we'll add pages with more details for starting with them as we can.

*** Report Preparation
- LaTeX
- OpenOffice
- poppler tools for pdf related commands
*** Plotting/ Data Visualization
- Python Matplotlib
- R ggplot2
- [[http://gnuplot.info/][gnuplot]]
*** Raster/Vector Drawings
- Krita
- GIMP
- [[https://inkscape.org/][Inkscape]]
*** Audio Editing
- [[https://www.audacityteam.org/][Audacity]]
*** Video Editing
- [[https://kdenlive.org/en/][Kdenlive]]

* Contribution
To add things to this list, please [[https://uc-linux-and-foss.github.io/][contact UC/Linux Club members]], join our discord and/or make the pull request directly to the [[https://github.com/UC-Linux-and-FOSS/UC-Linux-and-FOSS.github.io][github repository]] for this wiki.
