wiki/index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-01-16 Mon 12:17 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Wiki | UC Linux and FOSS Club</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/readtheorg.css"/>
</head>
<body>
<div id="content" class="content">
<h1 class="title">Wiki | UC Linux and FOSS Club</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgccea045">Recently Added Pages</a></li>
<li><a href="#org3984fff">Pinned Pages</a></li>
<li><a href="#org0305037">Categorized Index</a>
<ul>
<li><a href="#orgaaf4c86">Coping with no Linux Support</a></li>
<li><a href="#orgdbc3903"><span class="todo TODO">TODO</span> UC Related</a></li>
<li><a href="#org4cc7500">Daily Life</a></li>
<li><a href="#org18f5d10"><span class="todo TODO">TODO</span> Student Life</a></li>
<li><a href="#org024f5d0"><span class="todo TODO">TODO</span> Programming</a></li>
<li><a href="#org851ce38"><span class="todo TODO">TODO</span> FOSS Alternatives</a>
<ul>
<li><a href="#org3d24eb5">Report Preparation</a></li>
<li><a href="#orgf2de365">Plotting/ Data Visualization</a></li>
<li><a href="#orgc1c7f0d">Raster/Vector Drawings</a></li>
<li><a href="#orgeabf4f5">Audio Editing</a></li>
<li><a href="#org2f34ff7">Video Editing</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgf8fd183">Contribution</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgccea045" class="outline-2">
<h2 id="orgccea045">Recently Added Pages</h2>
<div class="outline-text-2" id="text-orgccea045">
<ul class="org-ul">
<li><a href="./dealing-with-pdfs.html">Dealing with PDFs</a></li>
<li><a href="./no-linux.html">What to do if you can't use something in Linux</a></li>
</ul>
</div>
</div>
<div id="outline-container-org3984fff" class="outline-2">
<h2 id="org3984fff">Pinned Pages</h2>
<div class="outline-text-2" id="text-org3984fff">
<ul class="org-ul">
<li><a href="https://uc-linux-and-foss.github.io">UC/Linux Club Details</a></li>
</ul>
</div>
</div>

<div id="outline-container-org0305037" class="outline-2">
<h2 id="org0305037">Categorized Index</h2>
<div class="outline-text-2" id="text-org0305037">
</div>
<div id="outline-container-orgaaf4c86" class="outline-3">
<h3 id="orgaaf4c86">Coping with no Linux Support</h3>
<div class="outline-text-3" id="text-orgaaf4c86">
<ul class="org-ul">
<li><a href="./no-linux.html">What to do if you can't use something in Linux</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgdbc3903" class="outline-3">
<h3 id="orgdbc3903"><span class="todo TODO">TODO</span> UC Related</h3>
<div class="outline-text-3" id="text-orgdbc3903">
<ul class="org-ul">
<li>UC Secure Connection Details</li>
</ul>
</div>
</div>
<div id="outline-container-org4cc7500" class="outline-3">
<h3 id="org4cc7500">Daily Life</h3>
<div class="outline-text-3" id="text-org4cc7500">
<ul class="org-ul">
<li><a href="./dealing-with-pdfs.html">Dealing with PDFs</a></li>
</ul>
</div>
</div>
<div id="outline-container-org18f5d10" class="outline-3">
<h3 id="org18f5d10"><span class="todo TODO">TODO</span> Student Life</h3>
</div>

<div id="outline-container-org024f5d0" class="outline-3">
<h3 id="org024f5d0"><span class="todo TODO">TODO</span> Programming</h3>
</div>

<div id="outline-container-org851ce38" class="outline-3">
<h3 id="org851ce38"><span class="todo TODO">TODO</span> FOSS Alternatives</h3>
<div class="outline-text-3" id="text-org851ce38">
<p>
The list will be constantly updating and we'll add pages with more details for starting with them as we can.
</p>
</div>

<div id="outline-container-org3d24eb5" class="outline-4">
<h4 id="org3d24eb5">Report Preparation</h4>
<div class="outline-text-4" id="text-org3d24eb5">
<ul class="org-ul">
<li>LaTeX</li>
<li>OpenOffice</li>
<li>poppler tools for pdf related commands</li>
</ul>
</div>
</div>
<div id="outline-container-orgf2de365" class="outline-4">
<h4 id="orgf2de365">Plotting/ Data Visualization</h4>
<div class="outline-text-4" id="text-orgf2de365">
<ul class="org-ul">
<li>Python Matplotlib</li>
<li>R ggplot2</li>
<li><a href="http://gnuplot.info/">gnuplot</a></li>
</ul>
</div>
</div>
<div id="outline-container-orgc1c7f0d" class="outline-4">
<h4 id="orgc1c7f0d">Raster/Vector Drawings</h4>
<div class="outline-text-4" id="text-orgc1c7f0d">
<ul class="org-ul">
<li>Krita</li>
<li>GIMP</li>
<li><a href="https://inkscape.org/">Inkscape</a></li>
</ul>
</div>
</div>
<div id="outline-container-orgeabf4f5" class="outline-4">
<h4 id="orgeabf4f5">Audio Editing</h4>
<div class="outline-text-4" id="text-orgeabf4f5">
<ul class="org-ul">
<li><a href="https://www.audacityteam.org/">Audacity</a></li>
</ul>
</div>
</div>
<div id="outline-container-org2f34ff7" class="outline-4">
<h4 id="org2f34ff7">Video Editing</h4>
<div class="outline-text-4" id="text-org2f34ff7">
<ul class="org-ul">
<li><a href="https://kdenlive.org/en/">Kdenlive</a></li>
</ul>
</div>
</div>
</div>
</div>

<div id="outline-container-orgf8fd183" class="outline-2">
<h2 id="orgf8fd183">Contribution</h2>
<div class="outline-text-2" id="text-orgf8fd183">
<p>
To add things to this list, please <a href="https://uc-linux-and-foss.github.io/">contact UC/Linux Club members</a>, join our discord and/or make the pull request directly to the <a href="https://github.com/UC-Linux-and-FOSS/UC-Linux-and-FOSS.github.io">github repository</a> for this wiki.
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Created: 2023-01-16 Mon 12:17</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
